tutorials/verification/innerSpherePartTransp/baseCase_dynamic/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// -- list of chemical species that are assumed
species (CO);

// -- list of porous Zones
zones (reactingCellZone);

// ************************************************************************* //
// -- information about individual chemical species
// -- ref == reference (carrier) gas 
ref
{
    // -- reference diffusion volume in m3mol-1 for diffusivity computations (see Fuller)
    sigmaV      16.2;                                                   

    // -- thermal conductivity polynom coeficients for reference gas Wm-1K-1
    // -- kappaGas = kappaA+kappaB*T+kappaC*Foam::pow(T,2)+kappaD*Foam::pow(T,3)
    kappaA  kappaA  [1 1 -3 -1 0 0 0] 0.3918e-3;                             
    kappaB  kappaB  [1 1 -3 -2 0 0 0] 0.9814e-4;                              
    kappaC  kappaC  [1 1 -3 -3 0 0 0] -5.0660e-8;                             
    kappaD  kappaD  [1 1 -3 -4 0 0 0] 1.503479e-11;   
    // kappaB  kappaB  [1 1 -3 -2 0 0 0] 0;                              
    // kappaC  kappaC  [1 1 -3 -3 0 0 0] 0;                             
    // kappaD  kappaD  [1 1 -3 -4 0 0 0] 0;   

    //specific heat of the substrate in Jkg-1K-1
    // Cp	    Cp 	    [0  2  -2   -1  0 0 0]  520.65;                       
}

CO
{
    sigmaV      18.0;                                                   

    // -- molar mass in kgmol-1
    molM        28.01e-3;

    // -- stoichiometric coefficients in reactions
    // minForGrad  1e-36;                                                   //min for gradien
    nuVec       (-1.0 -1.0);                                                     //row of the stoechiometric matrix                                                   
    alphaVec       (1.0 1.0);                                                     //row of the stoechiometric matrix                                                   
}

O2
{
    sigmaV      16.3;                                                   

    molM        32.0e-3;
    
    nuVec       (-0.5 0.0);                                                
    alphaVec    (1.0 0.0);                                               
}

CO2
{
    sigmaV      16.3;                                                   

    molM        28.96e-3;                                              
    
    //---
    nuVec       (1.0 0.0);                                                  //row of the stoechiometric matrix                                             
    alphaVec    (0.0 0.0);
}

reactingCellZone    
{   
    porEps      porEps      [0 0 0 0 0 0 0]         0.3;                                    //material porosity
    tort        tort        [0 0 0 0 0 0 0]         tortSet;                                    //material tortuosity
    dP	        dP	        [0 1 0 0 0 0 0]         1e-8;								    //Mean pore size (for Knudsen diffusion (effectively turn off here))
    //NOTETH dP is set small to reduce temperature effect on diffusion in this verification case
    kappa       kappa       [1 1 -3 -1 0 0 0]       kappaEffSet;                                    //thermal conductivity of material in Wm-1K-1
   // kappa       kappa       [1 1 -3 -1 0 0 0]       0.037758508;                                    //thermal conductivity of material in Wm-1K-1
    Cp          Cp          [0 2 -2 -1 0 0 0]       962;                                    //specific heat of the substrate in Jkg-1K-1
    rho         rho         [1 -3 0 0 0 0 0]        1000.0;                                 //efective density in kgm-3 (assumed constant)
    coatFrac    coatFrac    [0 0 0 0 0 0 0]         1.0;                                    //coating fraction in zone
}

// -- general constants
genProps
{
    univR   univR   [1  2 -2 -1 -1 0 0]  8.31446261815324;
}


// ************************************************************************* //
