tutorials/verification/innerSpherePartTransp/baseCase_dynamic/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField	uniform	(0 0 0.0);

boundaryField
{
    inlet
    {
        type    fixedValue;
	    value	uniform (inv 0 0.0);
    }
    
    outlet
    {
        type    zeroGradient;
    }
    
    sides
    {
        type    symmetry;
    }

    sphere
    {
        type    fixedValue;
	    value	uniform (0 0 0.0);
    } 
}


// ************************************************************************* //
