tutorials/verification/innerSpherePartTransp/baseCase_dynamic/0.org/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform isoT;

boundaryField
{
    inlet
    {
        type    fixedValue;
        value   uniform isoT;
    }
    outlet
    {
        type    zeroGradient;
    }
    sides
    {
        type    zeroGradient;
    }
    sphere
    {
        type    fixedValue;
        value   uniform isoT;
    }
}
